## Moodle Database: Educational Data Log Analysis

In this challenge we are going to analyze the 2019 10 Academy learners activity in the Moodle Learning Management System. The Moodle LMS  is a free and open-source learning management system written in PHP and distributed under the GNU General Public License. It is used for blended learning, distance education, flipped classroom and other e-learning projects in schools, universities, workplaces and other sectors.
In 2019, 10 Academy used the Moodle LMS to manage about 1000 students in their 6 months data science training. Learners, course instructors, and all admins interacted with the Moodle system for almost all the training activities. All events from these activities are logged in the moodle postgres database.

In this challenge we are asked to explore the 10 Academy Moodle logs stored in the database together with many other relevant tables. By the end of this analysis, we are expected to build a Tableau dashboard that illustrates the progress of students across time.


**We are going to follow the following 5 steps to build the solution**
1. Connecting postgressql to this notebook
2. Moodle database schema understanding by analyzing and dumping the giving sql data(I have already dumped the sql data)
3. Data Extraction Transformation and Loading (ETL) for dashboard and getting insight from the give data
4. Building Dashboard using tableau public 
5. Automation and Deployment

lets getstarted

### Step1. Connecting postgress to this notebook

In [1]:
# using magic method to load ipython-sql
%load_ext sql

In [5]:
# let import neccessary libraries to use it with postgresql 
from sqlalchemy import create_engine
import pandas as pd
import numpy as np
import matplotlib as plt

In [9]:
# creating engine to connect to postgresql database schema
engine = create_engine('postgresql://sami:samisami@localhost/moodle')

In [10]:
# Example format
%sql postgresql://sami:samisami@localhost/moodle

### Step2. Moodle database schema understanding by analyzing the given data

#### 2.1 write an SQL script to count the number of tables

In [13]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(448,)]

#### 2.2 write an SQL script to count the number of records in each of the tables given in the MIT section

###### from the given information the MIT(most important table) table are listed below 
1. 'mdl_logstore_standard_log'
2. 'mdl_context', 'mdl_user', 
3. 'mdl_course', 'mdl_modules' ,
4. 'mdl_course_modules', 
5. 'mdl_course_modules_completion',
6. 'mdl_grade_items',
7. 'mdl_grade_grades', 
8. 'mdl_grade_categories', 
9. 'mdl_grade_items_history',
10. 'mdl_grade_grades_history', 
11. 'mdl_grade_categories_history', 
12. 'mdl_forum', 
13. 'mdl_forum_discussions', 
14. 'mdl_forum_posts'

In [17]:
mit_tables = ['mdl_logstore_standard_log', 'mdl_context', 'mdl_user', 'mdl_course', 'mdl_modules' , 'mdl_course_modules', 'mdl_course_modules_completion',
       'mdl_grade_items', 'mdl_grade_grades', 'mdl_grade_categories', 'mdl_grade_items_history', 'mdl_grade_grades_history', 
       'mdl_grade_categories_history', 'mdl_forum', 'mdl_forum_discussions', 'mdl_forum_posts']

In [23]:
def row_count(mit_table):
    rows_count = %sql select count(*) as {mit_table}_rowcount from {mit_table}
    return rows_count

for table in mit_tables:
    display(row_count(table))

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(0,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(4359,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(1052,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(15,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(26,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(290,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(4483,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(113,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(3643,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(16,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(486,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(7108,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(46,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(34,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(23,)]

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(0,)]

#### 2.3 write an SQL script to count the number of quiz submissions by hour of day

In [26]:
%%sql

SELECT Extract(HOUR FROM to_timestamp(timecreated)) AS hour, count(*) 
FROM mdl_logstore_standard_log where action='submitted' AND component like '%quiz%' GROUP BY hour;

 * postgresql://sami:***@localhost/moodle
0 rows affected.

[]

#### 2.4 write an SQL script to monthly usage time of learners who have confirmed and are not deleted

In [31]:
%%sql

SELECT id, lastaccess - firstaccess AS UsageTime,
EXTRACT(MONTH FROM to_timestamp (firstaccess)) AS Month
FROM mdl_user WHERE confirmed = 1 AND deleted = 0 LIMIT 10;

 * postgresql://sami:***@localhost/moodle
10 rows affected.

[(1, 0, 1.0),
 (20, 13189566, 2.0),
 (15, 13903766, 2.0),
 (36, 9586676, 2.0),
 (44, 10458089, 2.0),
 (8, 1830649, 1.0),
 (13, 0, 1.0),
 (98, 12944059, 2.0),
 (28, 0, 1.0),
 (12, 0, 1.0)]

2.1 write an SQL script to count the number of tables

In [13]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(448,)]

2.1 write an SQL script to count the number of tables

In [13]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(448,)]

2.1 write an SQL script to count the number of tables

In [13]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(448,)]

2.1 write an SQL script to count the number of tables

In [13]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(448,)]

2.1 write an SQL script to count the number of tables

In [13]:
%%sql

select count(*)
from information_schema.tables
where table_schema = 'public';

 * postgresql://sami:***@localhost/moodle
1 rows affected.

[(448,)]